In [190]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:97% !important; }</style>"))

# # Session Overview
#### Pandas Package
 - 2 Data Types in Pandas: Series & DataFrame
 - Focus: DataFrame
 
#### Objective
 - Get basic understanding on DataFrame
 - Understand 2 main data types(Series & DataFrame) used in Data Science
 - Get how to study pandas package later on according to individual need.

<hr>

# [Contents]
 - Quick review
 - package alias
 - pandas.Series
 - pandas.DataFrame

# # Using pandas package

In [191]:
# pip install pandas

In [192]:
import pandas   # I loaded the pandas package on the memory of the computer.

In [193]:
pandas.DataFrame({'column': [1,2,3], 'column2':[4,5,7]})   # we use DataFrame method of pandas package

   column  column2
0       1        4
1       2        5
2       3        7

In [194]:
import pandas as pd   # alias

In [195]:
pd.DataFrame({'column': [1,2,3], 'column2':[4,5,7]})   # we use DataFrame method of pandas package

   column  column2
0       1        4
1       2        5
2       3        7

In [196]:
# Other examples
import math
import random
import numpy as np  
import pandas as pd
import matplotlib.pyplot as plt

# # Series
 - def.) a kind of **one-dimensional array** of any data type that we specified in the pandas module
 - def.) one-dimensional labeled array capable of holding any data type
 
 
 - pd.Series( )
 - index & values


 - Reference
   - https://www.tutorialgateway.org/python-series/
   - https://pandas.pydata.org/docs/user_guide/dsintro.html

In [197]:
import pandas as pd

In [198]:
arr = pd.Series([15, 35, 55, 75])

In [199]:
arr   # [15, 35, 55, 75]   (15, 35, 55, 75)

0    15
1    35
2    55
3    75
dtype: int64

In [200]:
arr.index   # 0, 1, 2, 3

RangeIndex(start=0, stop=4, step=1)

In [201]:
arr.values

array([15, 35, 55, 75])

In [202]:
name_series = pd.Series(['KDH', 'Kim', 'Hong', 'He'])

In [203]:
name_series

0     KDH
1     Kim
2    Hong
3      He
dtype: object

#### indexing

In [204]:
name_series[3]    # li = [1,2,3]  >> li[0]

'He'

In [205]:
name_series[0]

'KDH'

In [206]:
percentile_score = pd.Series([95, 100, 99], index=['KDH', 'Kim', 'He'])
percentile_score   # [95, 100, 99]

KDH     95
Kim    100
He      99
dtype: int64

In [207]:
percentile_score['He']

99

#### another example of series

In [208]:
student_ids = pd.Series(['A0231887U', 'A0123456U', 'A3141592U'])
student_ids

0    A0231887U
1    A0123456U
2    A3141592U
dtype: object

In [209]:
student_ids = pd.Series(['A0231887U', 'A0123456U', 'A3141592U'], name='id')
student_ids

0    A0231887U
1    A0123456U
2    A3141592U
Name: id, dtype: object


# # DataFrame
 - def.) a **2-dimensional labeled data structure** with columns of potentially different types  
 - *\"You can think of it like a **spreadsheet or SQL table**, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input*\"   


 - pd.DataFrame( )
 - row & column
 - index & column  


 - Reference
   - https://pandas.pydata.org/docs/user_guide/dsintro.html

In [210]:
student_ids = pd.Series(['A0231887U', 'A0123456U', 'A3141592U'], name='id')
memo_scores = pd.Series([15, 12, 11.2], name='scr_memo')
project_scores = pd.Series([30, 22, 27], name='scr_proj')

display(student_ids, memo_scores, project_scores)

0    A0231887U
1    A0123456U
2    A3141592U
Name: id, dtype: object

0    15.0
1    12.0
2    11.2
Name: scr_memo, dtype: float64

0    30
1    22
2    27
Name: scr_proj, dtype: int64

#### DataFrame

In [211]:
pd.DataFrame({'id':student_ids, 'scr_memo':memo_scores, 'scr_proj':project_scores})

          id  scr_memo  scr_proj
0  A0231887U      15.0        30
1  A0123456U      12.0        22
2  A3141592U      11.2        27

In [212]:
df_scores = pd.DataFrame({'id':student_ids, 'scr_memo':memo_scores, 'scr_proj':project_scores})
df_scores

          id  scr_memo  scr_proj
0  A0231887U      15.0        30
1  A0123456U      12.0        22
2  A3141592U      11.2        27

In [213]:
df = pd.DataFrame({'id':student_ids, 'scr_memo':memo_scores, 'scr_proj':project_scores})
df

          id  scr_memo  scr_proj
0  A0231887U      15.0        30
1  A0123456U      12.0        22
2  A3141592U      11.2        27

#### another dataframe

In [214]:
# Define DataFrame to use
student_ids = pd.Series(['A0231887U', 'A0231887U', 'A0231887U', 'A6535897U', 'A3238467U'], name='id')
student_names = pd.Series(['DH', 'PA', 'OB', 'BMH', 'NUS'], name='nm')
memo_scores = pd.Series([15, 12, 11.2, 13, 14], name='scr_memo')
project_scores = pd.Series([30, 22, 27, 19, 25], name='scr_proj')
poll_scores = pd.Series([15, 11, 14, 15, 9], name='scr_poll')

df = pd.DataFrame({'id':student_ids, 'nm':student_names, 'scr_memo':memo_scores, 'scr_proj':project_scores, 'scr_poll':poll_scores})
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

#### Basic checklist
 - read data (load data) >> colab
 - see some basic infos from the dataframe

In [215]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [216]:
df.columns

Index(['id', 'nm', 'scr_memo', 'scr_proj', 'scr_poll'], dtype='object')

In [217]:
df.shape   # (how many rows, how many columns)

(5, 5)

#### useful functions

In [218]:
df.head()  # head() function shows 6 top rows

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [219]:
df.head(n = 2)

          id  nm  scr_memo  scr_proj  scr_poll
0  A0231887U  DH      15.0        30        15
1  A0231887U  PA      12.0        22        11

In [220]:
df.head(3)

          id  nm  scr_memo  scr_proj  scr_poll
0  A0231887U  DH      15.0        30        15
1  A0231887U  PA      12.0        22        11
2  A0231887U  OB      11.2        27        14

In [221]:
df.tail()   # by default, tail function shows the last 6 rows of the dataframe

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [222]:
df.tail(2)

          id   nm  scr_memo  scr_proj  scr_poll
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [223]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [224]:
df.info()   # information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        5 non-null      object
 1   nm        5 non-null      object
 2   scr_memo  5 non-null      float64
 3   scr_proj  5 non-null      int64
 4   scr_poll  5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [225]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [226]:
df.describe()

       scr_memo  scr_proj   scr_poll
count   5.00000   5.00000   5.000000
mean   13.04000  24.60000  12.800000
std     1.51921   4.27785   2.683282
min    11.20000  19.00000   9.000000
25%    12.00000  22.00000  11.000000
50%    13.00000  25.00000  14.000000
75%    14.00000  27.00000  15.000000
max    15.00000  30.00000  15.000000

In [227]:
df.describe(include = 'all')

               id   nm  scr_memo  scr_proj   scr_poll
count           5    5   5.00000   5.00000   5.000000
unique          3    5       NaN       NaN        NaN
top     A0231887U   DH       NaN       NaN        NaN
freq            3    1       NaN       NaN        NaN
mean          NaN  NaN  13.04000  24.60000  12.800000
std           NaN  NaN   1.51921   4.27785   2.683282
min           NaN  NaN  11.20000  19.00000   9.000000
25%           NaN  NaN  12.00000  22.00000  11.000000
50%           NaN  NaN  13.00000  25.00000  14.000000
75%           NaN  NaN  14.00000  27.00000  15.000000
max           NaN  NaN  15.00000  30.00000  15.000000

In [228]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [229]:
df.corr()  # correlation >>

          scr_memo  scr_proj  scr_poll
scr_memo  1.000000  0.364674  0.014719
scr_proj  0.364674  1.000000  0.121965
scr_poll  0.014719  0.121965  1.000000

#### DataFrame - Indexing & Slicing
 - using index or column name
   - Ref.) https://github.com/hwaneest/Lectures/blob/master/%5BPractice%5D%20PP_loc_and_iloc.ipynb
 - Here, let's just slice the DataFrame using squared bracket.

In [230]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [231]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [232]:
list(df.index)

[0, 1, 2, 3, 4]

In [233]:
df.columns

Index(['id', 'nm', 'scr_memo', 'scr_proj', 'scr_poll'], dtype='object')

#### Slicing DataFrame by column name

In [234]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [235]:
df['id']   # returns the column >> returns the series

0    A0231887U
1    A0231887U
2    A0231887U
3    A6535897U
4    A3238467U
Name: id, dtype: object

In [236]:
df['nm']

0     DH
1     PA
2     OB
3    BMH
4    NUS
Name: nm, dtype: object

In [237]:
df['nm'] == 'BMH'                              # flag series that if the name is same as 'BMH'
# '==' : are the 2 things equivalent? 
# >> if they are equivalent, it returns True 
#    if they are not, it returns False

0    False
1    False
2    False
3     True
4    False
Name: nm, dtype: bool

In [238]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

In [239]:
df['id'] == 'A3238467U'  # flag series that identify if the id is same as 'A3238467U'.

0    False
1    False
2    False
3    False
4     True
Name: id, dtype: bool

In [240]:
df['scr_proj']

0    30
1    22
2    27
3    19
4    25
Name: scr_proj, dtype: int64

In [241]:
df['scr_proj'] > 24

0     True
1    False
2     True
3    False
4     True
Name: scr_proj, dtype: bool

In [242]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

#### I want to filter the students who got the score over 24

In [243]:
df[    df['scr_proj'] > 24    ]

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
2  A0231887U   OB      11.2        27        14
4  A3238467U  NUS      14.0        25         9

#### practice

In [244]:
df

          id   nm  scr_memo  scr_proj  scr_poll
0  A0231887U   DH      15.0        30        15
1  A0231887U   PA      12.0        22        11
2  A0231887U   OB      11.2        27        14
3  A6535897U  BMH      13.0        19        15
4  A3238467U  NUS      14.0        25         9

I want to filter the students who got the poll score lower than 10

In [245]:
df['scr_poll']

0    15
1    11
2    14
3    15
4     9
Name: scr_poll, dtype: int64

In [246]:
df['scr_poll'] < 10

0    False
1    False
2    False
3    False
4     True
Name: scr_poll, dtype: bool

In [247]:
df[  df['scr_poll'] < 10   ]

          id   nm  scr_memo  scr_proj  scr_poll
4  A3238467U  NUS      14.0        25         9

#### more than 1 condition
 - I want to filter the students who got the poll score lower than 10
 - I want to filter the students who got the score over 24

In [248]:
df['scr_poll'] < 10

0    False
1    False
2    False
3    False
4     True
Name: scr_poll, dtype: bool

In [249]:
df['scr_proj'] > 24

0     True
1    False
2     True
3    False
4     True
Name: scr_proj, dtype: bool

In [250]:
(df['scr_poll'] < 10) & (df['scr_proj'] > 24)    # flag series

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [251]:
df[ (df['scr_poll'] < 10) & (df['scr_proj'] > 24)   ]

          id   nm  scr_memo  scr_proj  scr_poll
4  A3238467U  NUS      14.0        25         9

#### #### *by. Donghwan Kim at National University of Singapore / Session for MSc. in HCMA students / Mar.2022 (E.O.D.)*